InformationRegisters/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗначения</Name>
					<Comment>Тип значения строкой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УчетнаяПолитика/Ext/ManagerModule.bsl
Функция Получи(ПараметрыКакСтруктура)Экспорт
	//На вход функции передаются ключи, на выходе функция возвращает пары ключ-значение
	
	КодВозвратаПоУмолчанию = Ложь;
	
	Если ТипЗнч(ПараметрыКакСтруктура) <> Тип("Структура") Тогда
		Возврат КодВозвратаПоУмолчанию;
	КонецЕсли; 
	
	ПараметрыКакСтрока="";
	Для Каждого Параметр Из ПараметрыКакСтруктура Цикл
		ПараметрыКакСтрока = ПараметрыКакСтрока + """"+Параметр.Ключ+""",";	
	КонецЦикла;
	ПараметрыКакСтрока = ПараметрыКакСтрока+"#";
	ПараметрыКакСтрока = СтрЗаменить(ПараметрыКакСтрока, ",#", "" );
	
	Запрос = Новый Запрос("ВЫБРАТЬ Параметр, Значение, ТипЗначения ИЗ РегистрСведений.УчетнаяПолитика.СрезПоследних ГДЕ Параметр В(&Параметры)");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Параметры",ПараметрыКакСтрока); 	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат КодВозвратаПоУмолчанию;
	КонецЕсли;
	
	Табл =  РезультатЗапроса.Выгрузить();
	
	Для Каждого Параметр Из ПараметрыКакСтруктура Цикл
		
		НайденнаяСтрока = Табл.Найти(Параметр.Ключ, "Параметр");
		Если НайденнаяСтрока = Неопределено Тогда
			//Параметр.Значение = Неопределено;
		Иначе
			
			ТипЗначенияПараметраСтрокой = НайденнаяСтрока.ТипЗначения;
			ЗначениеПараметра = НайденнаяСтрока.Значение;
			Если Тип(ТипЗначенияПараметраСтрокой) = Тип("Число") Тогда
				ЗначениеПараметра = Число(ЗначениеПараметра);
			ИначеЕсли Тип(ТипЗначенияПараметраСтрокой) = Тип("Булево") Тогда
				Если ЗначениеПараметра="ИСТИНА" Или  ЗначениеПараметра="Истина" Тогда
					ЗначениеПараметра = Истина;
				Иначе
					ЗначениеПараметра = Ложь;
				КонецЕсли;
			ИначеЕсли СтрНайти(ТипЗначенияПараметраСтрокой, "Ссылка")>0 И СтрНайти(ТипЗначенияПараметраСтрокой, "Справочник")>0 Тогда
				
				ЗначениеПараметра  = XMLЗначение(Тип(ТипЗначенияПараметраСтрокой), ЗначениеПараметра);
				
			КонецЕсли;	
			ПараметрыКакСтруктура.Удалить(Параметр.Ключ);
			ПараметрыКакСтруктура.Вставить(НайденнаяСтрока.Параметр, ЗначениеПараметра);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина
КонецФункции
